[
  {
    "id": 1,
    "title": "Desert Wildflower Explosion",
    "location": "Anza-Borrego Desert State Park, CA",
    "coordinates": {
      "lat": 33.2568,
      "lng": -116.4017
    },
    "shortDescription": "Spectacular display of desert wildflowers covering over 1,000 acres.",
    "fullDescription": "An extraordinary superbloom event featuring vibrant desert marigolds, ghost flowers, and desert lupine spreading across the desert floor. This rare phenomenon occurs when winter rains provide the perfect conditions for wildflower seeds that have been dormant for years. The bloom creates a stunning carpet of yellow, purple, and white flowers that can be seen from space. Peak viewing is expected to last for 2-3 weeks, with the best colors visible in early morning and late afternoon light.",
    "tags": ["Superbloom", "Desert"],
    "season": "Spring",
    "peakTime": "March 15 - April 5",
    "peakTimeInterval": ["2025-03-15", "2025-04-05"],
    "isActive": true,
    "images": [
      "/images/cali-bloom.avif",
      "/images/anza-borrego-bloom.jpg",
      "https://www.rwongphoto.com/images/xl/RW319-2_web.jpg"
    ],
    "satelliteImages": [
      {
        "year": "March 2016 - March 2017",
        "image": "/images/anza-borrego.gif"
      }
    ],
    "graphImages": [
      {
        "image": "/graphs/anza_superbloom_comparison.png"
      },
      {
        "image": "/graphs/anza_time_series_combined.png"
      }
    ]
  },
  {
    "id": 2,
    "title": "Poppy Fields Phenomenon",
    "location": "Antelope Valley, CA",
    "coordinates": {
      "lat": 34.7353,
      "lng": -118.1256
    },
    "shortDescription": "Miles of brilliant orange California poppies in full bloom.",
    "fullDescription": "The annual California poppy bloom in Antelope Valley creates one of the most photographed natural displays in the state. Covering nearly 1,700 acres, the vibrant orange blooms create rolling waves of color across the valley floor. This superbloom is particularly special due to above-average rainfall this winter, resulting in the densest poppy coverage seen in over a decade. Visitors can walk among designated trails to experience the full beauty of California's state flower.",
    "tags": ["Superbloom", "Valley"],
    "season": "Spring",
    "peakTime": "April 1 - April 20",
    "peakTimeInterval": ["2025-04-01", "2025-04-20"],
    "isActive": true,
    "images": [
      "/images/antelope_bloom1.webp",
      "/images/antelope_bloom2.webp",
      "/images/antelope_bloom3.avif"
    ],
    "satelliteImages": [
      {
        "year": "April 2024 🌸",
        "image": "/images/antelope_bloom_sat.jpg"
      }
    ],
    "graphImages": [
      {
        "image": "/graphs/antelope_superbloom_comparison.png"
      },
      {
        "image": "/graphs/antelope_time_series.png"
      }
    ]
  },
  {
    "id": 3,
    "title": "Valley of Flowers",
    "location": "Valley of Flowers National Park, Uttarakhand, India",
    "coordinates": {
      "lat": 30.7268,
      "lng": 79.6069
    },
    "shortDescription": "UNESCO World Heritage site featuring over 600 alpine flower species.",
    "fullDescription": "The Valley of Flowers is a breathtaking high-altitude Himalayan valley renowned for its endemic flora and spectacular meadows of alpine flowers. This UNESCO World Heritage site comes alive during the monsoon season with a carpet of vibrant wildflowers including blue poppies, brahma kamals, cobra lilies, and primulas. Located at an elevation of 3,658 meters, the valley transforms into a natural botanical garden spanning over 87 square kilometers. The best viewing requires a challenging trek, but rewards visitors with one of the most spectacular floral displays on Earth.",
    "tags": ["Yearly", "Alpine", "UNESCO"],
    "season": "Monsoon",
    "peakTime": "July 15 - August 31",
    "peakTimeInterval": ["2025-07-15", "2025-08-31"],
    "isActive": true,
    "images": [
      "/images/valley_bloom1.jpg",
      "/images/valley_bloom2.jpg",
      "/images/valley_bloom3.avif"
    ]
  },
  {
    "id": 4,
    "title": "Death Valley Superbloom",
    "location": "Death Valley National Park, CA",
    "coordinates": {
      "lat": 36.5323,
      "lng": -116.9325
    },
    "shortDescription": "Rare wildflower explosion in one of Earth's most extreme environments.",
    "fullDescription": "Death Valley's rare superbloom is one of nature's most spectacular surprises, occurring only when perfect conditions align. This extraordinary event transforms the desert floor into a vibrant carpet of desert gold, ghost flower, and purple-stemmed desert lupine. The phenomenon requires precise timing of winter rains, warm spring temperatures, and minimal wind. When it occurs, millions of wildflower seeds that have lain dormant for years suddenly burst to life, creating a stunning contrast against the stark landscape. The blooms typically last only 2-4 weeks, making this one of the rarest and most sought-after natural spectacles in North America.",
    "tags": ["Superbloom", "Desert", "Rare"],
    "season": "Spring",
    "peakTime": "February 20 - March 20",
    "peakTimeInterval": ["2025-02-20", "2025-03-20"],
    "isActive": false,
    "images": [
      "/images/death_bloom1.jpg",
      "/images/death_bloom2.jpg",
      "/images/death_bloom3.jpg",
      "/images/death_bloom4.avif"
    ]
  },
  {
    "id": 5,
    "title": "Carrizo Plain Wildflower Display",
    "location": "Carrizo Plain National Monument, CA",
    "coordinates": {
      "lat": 35.2225,
      "lng": -119.5871
    },
    "shortDescription": "California's largest remaining natural grassland transforms into a wildflower paradise.",
    "fullDescription": "The Carrizo Plain, often called 'California's Serengeti,' becomes a spectacular wildflower showcase during optimal spring conditions. This vast grassland ecosystem bursts with vibrant displays of California poppies, lupines, goldfields, and purple owl's clover. The plain's unique topography creates microclimates that support diverse wildflower communities, from valley floors carpeted in orange poppies to hillsides painted purple with lupines. The bloom's intensity varies dramatically year to year, depending on winter rainfall patterns, making exceptional years truly spectacular events that draw photographers and botanists from around the world.",
    "tags": ["Superbloom", "Grassland"],
    "season": "Spring",
    "peakTime": "March 25 - April 30",
    "peakTimeInterval": ["2025-03-25", "2025-04-30"],
    "isActive": true,
    "images": [
      "/images/carizzo_bloom1.webp",
      "/images/carizzo_bloom2.jpg",
      "/images/carizzo_bloom3.jpeg"
    ],
    "satelliteImages": [
      {
        "year": "2017 🌺",
        "image": "/images/carizzo-bloom-2017.webp"
      },
      {
        "year": "2017 🌵",
        "image": "/images/carizzo-nonbloom-2017.webp"
      }
    ],
    "graphImages": [
      {
        "image": "/graphs/carizzo_superbloom_comparison.png"
      },
      {
        "image": "/graphs/carizzo_time_series_combined.png"
      }
    ]
  },
  {
    "id": 6,
    "title": "Atacama Desert Bloom",
    "location": "Atacama Desert, Chile",
    "coordinates": {
      "lat": -24.5000,
      "lng": -69.2500
    },
    "shortDescription": "World's driest desert transforms into a colorful carpet of wildflowers.",
    "fullDescription": "The Atacama Desert bloom, known locally as 'Desierto Florido,' is one of the world's most extraordinary natural phenomena. This rare event occurs in the world's driest non-polar desert when unusual rainfall awakens millions of dormant seeds. The desert floor explodes with vibrant displays of purple and white añañuca, yellow desert marigolds, and pink cristaria. This spectacular transformation happens roughly every 5-7 years when El Niño brings sufficient rainfall to the region. The blooms create a surreal landscape that attracts visitors from around the globe to witness this miraculous desert awakening.",
    "tags": ["Superbloom", "Desert", "Rare"],
    "season": "Spring",
    "peakTime": "September 15 - November 15",
    "peakTimeInterval": ["2025-09-15", "2025-11-15"],
    "isActive": false,
    "images": [
      "/images/atacama-bloom.avif",
      "/images/atacama-bloom2.webp"
    ],
    "satelliteImages": [
      {
        "year": "2021 🌸",
        "image": "/images/20211025_BloomAtacamaDesert_Chile.jpg"
      }
    ]
  },
  {
    "id": 7,
    "title": "Namaqualand Spectacle",
    "location": "Namaqualand, South Africa",
    "coordinates": {
      "lat": -30.1500,
      "lng": 17.9000
    },
    "shortDescription": "Semi-arid region transforms into a vibrant carpet of indigenous daisies and succulents.",
    "fullDescription": "Namaqualand's annual flower season is one of South Africa's most celebrated natural spectacles. This semi-arid region bursts into life with millions of indigenous daisies, including the iconic orange Namaqualand daisy, creating vast carpets of color that stretch to the horizon. The display also features over 4,000 plant species, many endemic to the region, including colorful mesembs, vygies, and aloes. The phenomenon is triggered by winter rains and warm spring temperatures, typically peaking in late August to early September. The flowers have evolved to open only in bright sunlight, creating daily cycles of color that make each viewing unique.",
    "tags": ["Yearly", "Semi-arid"],
    "season": "Spring",
    "peakTime": "August 20 - September 30",
    "peakTimeInterval": ["2025-08-20", "2025-09-30"],
    "isActive": true,
    "images": [
      "/images/namaqualand-1.jpg",
      "/images/namaqualand-2.jpg",
      "/images/namaqualand-3.jpg"
    ]
  },
  {
    "id": 8,
    "title": "Keukenhof Gardens",
    "location": "Keukenhof, Netherlands",
    "coordinates": {
      "lat": 52.2720,
      "lng": 4.5462
    },
    "shortDescription": "World's largest flower garden featuring millions of tulips, daffodils, and hyacinths.",
    "fullDescription": "Keukenhof, known as the 'Garden of Europe,' is the world's largest flower garden and one of the most photographed places on Earth. Each spring, over 7 million flower bulbs bloom across 79 acres, creating stunning displays of tulips, daffodils, hyacinths, and other spring bulbs. The garden features meticulously designed themed areas, including formal gardens, natural landscapes, and artistic installations. Beyond the planted displays, visitors can explore historic windmills, pavilions showcasing the latest flower varieties, and walking paths that wind through forests of flowering trees. The garden is open for just eight weeks each year, making it a concentrated celebration of spring's arrival in the Netherlands.",
    "tags": ["Yearly", "Cultivated"],
    "season": "Spring",
    "peakTime": "April 15 - May 10",
    "peakTimeInterval": ["2025-04-15", "2025-05-10"],
    "isActive": true,
    "images": [
      "/images/keukenhof-1.avif",
      "/images/keukenhof-2.jpg",
      "/images/keukenhof-3.jpg",
      "/images/keukenhof-4.jpg"
    ],
    "satelliteImages": [
      {
        "year": "April 2020 🌸",
        "image": "/images/keukenhof-bloom.webp"
      },
      {
        "year": "November 2020 🌵",
        "image": "/images/keukenhof-not-bloom.webp"
      }
    ]
  }
]